
# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/cask-drivers"
tap "homebrew/services"
tap "teamookla/speedtest"
tap "romkatv/powerlevel10k"

# GNU core utilities (those that come with OS X are outdated)

brew 'coreutils'
brew 'gawk'
brew 'gnu-indent'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnutls'
brew 'grep'

# GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed

brew 'findutils'

# Brew packages
brew 'awscli'
brew "dvc"
# Fork visual git tool
#cask "fork" 
brew "gh"
brew "git-extras"
brew "gnupg"
brew "go"
brew "graphicsmagick"
#brew "helm"
brew "imagemagick"
brew "jq"
brew "kubernetes-cli"
brew "mas"
brew "nodenv"
brew "pyenv"
brew "poetry"
brew "speedtest"
brew "tree"
brew "wget"
brew "yarn"
brew "youtube-dl"
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"
brew "romkatv/powerlevel10k/powerlevel10k"

# App Casks

cask "1password"
# rogueamoeba sys audio recorder
cask "audio-hijack"
#cask "authy"
#cask "alfred"
cask "beyond-compare"
# cask "dash"
cask "discord"
cask "docker"
cask "dropbox"
cask "obs"
# rogueamoeba audio sound effects app
cask "farrago"
cask "figma"
# rogueamoeba audio editing app
cask "fission"
# Flutter
cask "android-studio"
cask "android-SDK"
cask "android-ndk"
cask "flutter"
# End Flutter
cask "grammarly"
cask "handbrake"
cask "iterm2"
# krisp.ai noise remover for calls
cask "krisp"
# Mac markdown editor
cask "macdown"
cask "notion"
cask "pycharm"
cask "postman"
cask "signal"
cask "sketch"
cask "slack"
cask "spotify"
# Tower visual git tool
#cask "tower" 
cask "visual-studio-code"
cask "zoom"

# Font Casks

cask "font-hack-nerd-font"
cask "font-inconsolata-for-powerline"
cask "font-menlo-for-powerline"
cask 'font-roboto'

# Mac App Store apps

mas "1Password 7", id: 1333542190
#mas "DaisyDisk", id: 411643860
mas "Developer", id: 640199958
#mas "Drafts", id: 1435957248
# mas "iA Writer", id: 775737590
mas "Keynote", id: 409183694
mas "WhatsApp", id: 1147396723
mas "In Your Face", id: 1476964367
mas "iThoughts", id: 720669838
mas "Focus ToDo - Pomodoro & Tasks", id: 1258530160